<template>
    <div class="federation-about w-100 d-flex flex-column align-items-center">
        <div class="section">
            <Breadcrumb item1="Главная" item2="О Федерации" class="mt-5"/>
            <h3 class="font-weight-bold">О федерации</h3>
            <span class="d-flex align-items-center mt-4 mb-4">
                <img src="@assets/images/photo.png"/>
                <span class="ml-3">
                    <p class="name font-weight-bold">Мансуров Сабит</p>
                    <p class="position">Генеральный директор</p>
                </span>
            </span>
            <p class="text mb-5 pb-5">
                Японские боевые искусства, включающие в себя техники
                работы с оружием и без него. Искусство рукопашного боя,
                основным принципом которого является «мягкая», «податливая»
                техника движений. Японские боевые искусства, включающие в
                себя техники работы с оружием и без него. Искусство рукопашного
                боя, основным принципом которого является «мягкая»,
                «податливая» техника движений.
            </p>
            <h3 class="mt-5 pt-5">Федерация Джиу-Джитсу</h3>
            <span class="d-flex justify-content-between mt-4 mb-5">
                <p>
                    Японские боевые искусства, включающие в
                    себя техники работы с оружием и без него.
                    Искусство рукопашного боя, основным принципом
                    которого является «мягкая», «податливая» техника
                    движений. Японские боевые искусства, включающие
                    в себя техники работы с оружием и без него.
                    Искусство рукопашного боя, основным принципом
                    которого является «мягкая», «податливая» техника
                    движений. Японские боевые искусства, включающие
                    в себя техники работы с оружием и без него. Искусство
                    рукопашного боя, основным принципом которого
                    является «мягкая», «податливая» техника движений.
                    Японские боевые искусства, включающие в себя техники
                    работы с оружием и без него. Искусство рукопашного
                    боя, основным принципом которого является «мягкая»,
                    «податливая» техника движений.
                </p>
                <p>
                    Японские боевые искусства, включающие в себя техники
                    работы с оружием и без него. Искусство рукопашного боя,
                    основным принципом которого является «мягкая», «податливая»
                    техника движений. Японские боевые искусства, включающие в
                    себя техники работы с оружием и без него. Искусство рукопашного
                    боя, основным принципом которого является «мягкая», «податливая»
                    техника движений. Японские боевые искусства, включающие в себя
                    техники работы с оружием и без него. Искусство рукопашного боя,
                    основным принципом которого является «мягкая», «податливая» техника
                    движений. Японские боевые искусства, включающие в себя техники
                    работы с оружием и без него. Искусство рукопашного боя, основным
                    принципом которого является «мягкая», «податливая» техника движений.
                </p>
            </span>
            <h3 class="mt-5">История федерации</h3>
            <div class="position-relative">
                <img
                    class="position-absolute scroll-left"
                    src="@assets/images/common/arrow-left.svg"
                    @click="scroll('left')"
                />
                <vue-horizontal-timeline
                    class="mb-5 mt-5"
                    :items="items"
                />
                <img
                    class="position-absolute scroll-right"
                    src="@assets/images/common/blue-arrow-right.svg"
                    @click="scroll('right')"
                />
            </div>
        </div>
    </div>
</template>
<script>
    import Breadcrumb from "../Components/breadcrumb";
    export default{
        components: {Breadcrumb},
        data() {
            const year1 = {
                title: '03.2010',
                content: 'Японские боевые искусства, включающие в себя техники работы с оружием и без него. Искусство рукопашного боя, основным принципом которого является «мягкая», «податливая» техника движений.'
            }
            const year2 = {
                title: '03.2010',
                content: 'Японские боевые искусства, включающие в себя техники работы с оружием и без него. Искусство рукопашного боя, основным принципом которого является «мягкая», «податливая» техника движений.'
            }
            const year3 = {
                title: '03.2010',
                content: 'Японские боевые искусства, включающие в себя техники работы с оружием и без него. Искусство рукопашного боя, основным принципом которого является «мягкая», «податливая» техника движений.'
            }
            const year4 = {
                title: '03.2010',
                content: 'Японские боевые искусства, включающие в себя техники работы с оружием и без него. Искусство рукопашного боя, основным принципом которого является «мягкая», «податливая» техника движений.'
            }
            const year5 = {
                title: '03.2010',
                content: 'Японские боевые искусства, включающие в себя техники работы с оружием и без него. Искусство рукопашного боя, основным принципом которого является «мягкая», «податливая» техника движений.'
            }
            const year6 = {
                title: '03.2010',
                content: 'Японские боевые искусства, включающие в себя техники работы с оружием и без него. Искусство рукопашного боя, основным принципом которого является «мягкая», «податливая» техника движений.'
            }
            const items = [year1,year2,year3, year4,year5,year6];

            return { items }
        },
        methods:{
            scroll(dir) {
                if (dir === 'left') {
                    let container = document.getElementsByClassName('timeline')[0];
                    container.scrollBy({left: '-250', behavior: 'smooth'})
                }
                else if (dir === 'right') {
                    let container = document.getElementsByClassName('timeline')[0];
                    container.scrollBy({left: '250', behavior: 'smooth'})
                }
            }
        },
    }
</script>
